Revit 2024 API
Wall.Flip Method
 The wall orientation will be flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Flip()
Visual Basic
Public Sub Flip
Visual C++
public:
void Flip()
See Also
Wall Class
Autodesk.Revit.DB Namespace